Revit 2027 API
FilterDialog.NewFilterId Property
 The ElementId of the new filter created. The value is populated after Show method is executed.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId NewFilterId { get; }
Public ReadOnly Property NewFilterId As ElementId
	Get
public:
property ElementId^ NewFilterId {
	ElementId^ get ();
}
member NewFilterId : ElementId with get
Property Value
ElementId
See Also
Reference
FilterDialog Class
Autodesk.Revit.UI Namespace